<template>
<div class="page-footer">
        <div class="page-footer-copyright">
            تمامی حقوق این سایت متعلق به دانشگاه امیرکبیر بوده و هرگونه استفاده از منابع و طراحی‌های این سایت توسط نهادی خارج از دانشگاه
            با پیگرد قانونی همراه خواهد بود</div>
        <div class="page-footer-social">
            <div class="page-footer-social-text">به ما در شبکه‌های اجتماعی بپیوندید</div>
            <div class="page-footer-social-icons">
                <span class="social-logo">
                    <svg enable-background="new 0 0 25 25" version="1.1" viewBox="0 0 32 32" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g id="Flat_copy" transform="scale(1)">
                            <g>
                                <path d="M16,0C7.163,0,0,7.163,0,16c0,8.836,7.163,16,16,16s16-7.164,16-16C32,7.163,24.837,0,16,0z" />
                            </g>
                            <path d="M18.226,8.886c-1.59,0.579-2.595,2.071-2.481,3.704l0.038,0.63l-0.636-0.077   c-2.315-0.296-4.338-1.299-6.056-2.984l-0.84-0.836L8.036,9.94c-0.458,1.376-0.165,2.83,0.789,3.808   c0.509,0.54,0.394,0.617-0.483,0.296c-0.305-0.103-0.573-0.18-0.598-0.141c-0.089,0.09,0.216,1.26,0.458,1.724   c0.331,0.644,1.005,1.273,1.743,1.647l0.624,0.296L9.83,17.581c-0.712,0-0.738,0.013-0.661,0.284   c0.254,0.836,1.259,1.724,2.379,2.11l0.789,0.27l-0.687,0.412c-1.018,0.593-2.214,0.927-3.41,0.951   c-0.573,0.013-1.044,0.064-1.044,0.103c0,0.128,1.553,0.848,2.455,1.132c2.71,0.836,5.929,0.475,8.346-0.952   c1.718-1.016,3.435-3.036,4.237-4.992c0.433-1.041,0.865-2.945,0.865-3.858c0-0.592,0.038-0.669,0.75-1.376   c0.42-0.412,0.814-0.862,0.891-0.99c0.128-0.245,0.114-0.245-0.534-0.026c-1.081,0.386-1.234,0.335-0.699-0.244   c0.394-0.412,0.865-1.158,0.865-1.376c0-0.038-0.191,0.026-0.407,0.141c-0.229,0.129-0.738,0.322-1.12,0.437l-0.687,0.219   L21.535,9.4c-0.344-0.231-0.826-0.489-1.081-0.566C19.804,8.654,18.812,8.68,18.226,8.886z"
                                fill="#FFFFFF" />
                        </g>
                    </svg>
                </span>
                <span class="social-logo">
                    <svg enable-background="new 0 0 32 32" version="1.1" viewBox="0 0 32 32" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g id="Flat_copy">
                            <g>
                                <path d="M16-0.005c-8.837,0-16,7.163-16,16c0,8.836,7.163,16,16,16s16-7.164,16-16C32,7.158,24.837-0.005,16-0.005    z" />
                            </g>
                            <g>
                                <path d="M18.209,7.177c0,0-4.049,0-5.435,0c-2.486,0-4.827,1.745-4.827,3.926c0,2.229,1.695,3.962,4.224,3.962    c0.176,0,0.347-0.04,0.515-0.052c-0.166,0.313-0.28,0.65-0.28,1.017c0,0.62,0.332,1.114,0.753,1.524    c-0.316,0-0.625,0.004-0.961,0.004c-3.08,0.001-5.45,1.961-5.45,3.995c0,2.003,2.599,3.258,5.679,3.258    c3.512,0,5.451-1.994,5.451-3.997c0-1.606-0.474-2.568-1.939-3.607c-0.502-0.354-1.46-1.217-1.46-1.725    c0-0.594,0.169-0.887,1.065-1.587c0.916-0.716,1.566-1.57,1.566-2.743c0-1.394-0.6-3.095-1.766-3.095h1.984L18.209,7.177z     M16.385,20.467c0.042,0.187,0.068,0.378,0.068,0.572c0,1.619-1.045,2.884-4.038,2.884c-2.129,0-3.666-1.347-3.666-2.966    c0-1.586,1.907-2.908,4.037-2.884c0.495,0.005,0.959,0.086,1.379,0.22C15.321,19.098,16.15,19.552,16.385,20.467z M12.975,14.429    c-1.429-0.041-2.788-1.598-3.034-3.474c-0.246-1.878,0.712-3.314,2.141-3.272c1.428,0.044,2.788,1.55,3.034,3.426    C15.362,12.986,14.404,14.471,12.975,14.429z"
                                    fill="#FFFFFF" />
                                <polygon fill="#FFFFFF" points="22.618,14.224 22.618,11.579 20.854,11.579 20.854,14.224 18.209,14.224 18.209,15.988     20.854,15.988 20.854,18.633 22.618,18.633 22.618,15.988 25.263,15.988 25.263,14.224   "
                                />
                            </g>
                        </g>
                    </svg>
                </span>
                <span class="social-logo">
                    <svg enable-background="new 0 0 32 32" version="1.1" viewBox="0 0 32 32" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g id="Flat_copy">
                            <g>
                                <path d="M16,0C7.163,0,0,7.163,0,16c0,8.836,7.163,16,16,16s16-7.164,16-16C32,7.163,24.837,0,16,0z" />
                            </g>
                            <path d="M13.69,24.903h3.679v-8.904h2.454l0.325-3.068h-2.779l0.004-1.536c0-0.8,0.076-1.229,1.224-1.229h1.534   V7.097h-2.455c-2.949,0-3.986,1.489-3.986,3.992v1.842h-1.838v3.069h1.838V24.903z"
                                fill="#FFFFFF" />
                        </g>
                    </svg>
                </span>
            </div>
            <div class="page-footer-social-icons">
                <span class="social-logo">
                    <svg enable-background="new 0 0 25 25" version="1.1" viewBox="0 0 32 32" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g id="Flat_copy" transform="scale(1)">
                            <g>
                                <path d="M16,0C7.163,0,0,7.163,0,16c0,8.836,7.163,16,16,16s16-7.164,16-16C32,7.163,24.837,0,16,0z" />
                            </g>
                            <path d="M18.226,8.886c-1.59,0.579-2.595,2.071-2.481,3.704l0.038,0.63l-0.636-0.077   c-2.315-0.296-4.338-1.299-6.056-2.984l-0.84-0.836L8.036,9.94c-0.458,1.376-0.165,2.83,0.789,3.808   c0.509,0.54,0.394,0.617-0.483,0.296c-0.305-0.103-0.573-0.18-0.598-0.141c-0.089,0.09,0.216,1.26,0.458,1.724   c0.331,0.644,1.005,1.273,1.743,1.647l0.624,0.296L9.83,17.581c-0.712,0-0.738,0.013-0.661,0.284   c0.254,0.836,1.259,1.724,2.379,2.11l0.789,0.27l-0.687,0.412c-1.018,0.593-2.214,0.927-3.41,0.951   c-0.573,0.013-1.044,0.064-1.044,0.103c0,0.128,1.553,0.848,2.455,1.132c2.71,0.836,5.929,0.475,8.346-0.952   c1.718-1.016,3.435-3.036,4.237-4.992c0.433-1.041,0.865-2.945,0.865-3.858c0-0.592,0.038-0.669,0.75-1.376   c0.42-0.412,0.814-0.862,0.891-0.99c0.128-0.245,0.114-0.245-0.534-0.026c-1.081,0.386-1.234,0.335-0.699-0.244   c0.394-0.412,0.865-1.158,0.865-1.376c0-0.038-0.191,0.026-0.407,0.141c-0.229,0.129-0.738,0.322-1.12,0.437l-0.687,0.219   L21.535,9.4c-0.344-0.231-0.826-0.489-1.081-0.566C19.804,8.654,18.812,8.68,18.226,8.886z"
                                fill="#FFFFFF" />
                        </g>
                    </svg>
                </span>
                <span class="social-logo">
                    <svg enable-background="new 0 0 32 32" version="1.1" viewBox="0 0 32 32" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g id="Flat_copy">
                            <g>
                                <path d="M16-0.005c-8.837,0-16,7.163-16,16c0,8.836,7.163,16,16,16s16-7.164,16-16C32,7.158,24.837-0.005,16-0.005    z" />
                            </g>
                            <g>
                                <path d="M18.209,7.177c0,0-4.049,0-5.435,0c-2.486,0-4.827,1.745-4.827,3.926c0,2.229,1.695,3.962,4.224,3.962    c0.176,0,0.347-0.04,0.515-0.052c-0.166,0.313-0.28,0.65-0.28,1.017c0,0.62,0.332,1.114,0.753,1.524    c-0.316,0-0.625,0.004-0.961,0.004c-3.08,0.001-5.45,1.961-5.45,3.995c0,2.003,2.599,3.258,5.679,3.258    c3.512,0,5.451-1.994,5.451-3.997c0-1.606-0.474-2.568-1.939-3.607c-0.502-0.354-1.46-1.217-1.46-1.725    c0-0.594,0.169-0.887,1.065-1.587c0.916-0.716,1.566-1.57,1.566-2.743c0-1.394-0.6-3.095-1.766-3.095h1.984L18.209,7.177z     M16.385,20.467c0.042,0.187,0.068,0.378,0.068,0.572c0,1.619-1.045,2.884-4.038,2.884c-2.129,0-3.666-1.347-3.666-2.966    c0-1.586,1.907-2.908,4.037-2.884c0.495,0.005,0.959,0.086,1.379,0.22C15.321,19.098,16.15,19.552,16.385,20.467z M12.975,14.429    c-1.429-0.041-2.788-1.598-3.034-3.474c-0.246-1.878,0.712-3.314,2.141-3.272c1.428,0.044,2.788,1.55,3.034,3.426    C15.362,12.986,14.404,14.471,12.975,14.429z"
                                    fill="#FFFFFF" />
                                <polygon fill="#FFFFFF" points="22.618,14.224 22.618,11.579 20.854,11.579 20.854,14.224 18.209,14.224 18.209,15.988     20.854,15.988 20.854,18.633 22.618,18.633 22.618,15.988 25.263,15.988 25.263,14.224   "
                                />
                            </g>
                        </g>
                    </svg>
                </span>
                <span class="social-logo">
                    <svg enable-background="new 0 0 32 32" version="1.1" viewBox="0 0 32 32" xml:space="preserve" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink">
                        <g id="Flat_copy">
                            <g>
                                <path d="M16,0C7.163,0,0,7.163,0,16c0,8.836,7.163,16,16,16s16-7.164,16-16C32,7.163,24.837,0,16,0z" />
                            </g>
                            <path d="M13.69,24.903h3.679v-8.904h2.454l0.325-3.068h-2.779l0.004-1.536c0-0.8,0.076-1.229,1.224-1.229h1.534   V7.097h-2.455c-2.949,0-3.986,1.489-3.986,3.992v1.842h-1.838v3.069h1.838V24.903z"
                                fill="#FFFFFF" />
                        </g>
                    </svg>
                </span>
            </div>
            <div class="page-footer-social-list"> </div>

        </div>
        <div class="page-footer-list">
            <div style="font-weight:bold; font-size:1.3ex;">
                اطلاعات‌ ما
            </div>
            <hr>
            <div class="footer-entry">
                درباره‌ی ما
            </div>
            <div class="footer-entry">
                تماس با ما
            </div>

        </div>

        <div class="page-footer-list">
            <div style="font-weight:bold; font-size:1.3ex;">
                خدمات مشتریان
            </div>
            <hr>
            <div class="footer-entry">
                سوالات متداول
            </div>
            <div class="footer-entry">
                بازگرداندن کالا
            </div>
            <div class="footer-entry">
                شرایط استفاده
            </div>
            <div class="footer-entry">
                حریم شخصی
            </div>

        </div>
    </div>
</template>

<style scoped>
@font-face {
    font-family: "my_iran_sans";
    src: url("./fonts/IRAN-sans.ttf");
}

* {
    font-family: "my_iran_sans";
}
.page-footer{
    margin-top: 40px;
    bottom: 0;
    left: 0;
    opacity: 10%;
    display: flex;
    justify-content: space-around;
    background: rgba(139, 129, 129, 0.294);
    height: 150px;
    width: 100%;
}

.page-footer-copyright{
    color: rgb(46, 45, 45);
    width: 25%;
    margin-top: 20px;
    font-size: 1.1ex;
    text-align: right;
    font-weight: 700;
}

.page-footer-social{
    margin-top: 20px;
}

.page-footer-social-text{
    font-size:1.3ex;
    font-weight: 600;
    text-align: center; 
    color: rgb(51, 51, 51);
}

.page-footer-list{
    margin-top: 20px;
    margin-bottom: 10px;
}

.footer-entry{
    
    margin-top: 2px;
    font-size: 0.8em;
    color: rgb(65, 64, 64);
    text-align: center;  
}

.footer-entry:hover{
    font-weight: 900;
    cursor: pointer;
    color: rgb(34, 96, 231);
    margin-top: 2px;
    font-size: 0.8em;
    text-align: center;  
}

.page-footer-social-icons{
    position: relative;
    left: 40px;
    width:60%;
    margin-top: 10px;   
    display: flex;
    justify-content: space-around;      
}

.social-logo{
    left: 30px;
    margin-left:auto;
    margin-right: auto; 
    fill: gray;
    width: 32px;
    height: 32px;  
}

.social-logo:hover{
    left: 30px;
    margin-left:auto;
    margin-right: auto; 
    cursor: pointer;
    fill: rgb(34, 96, 231);;
    width: 32px;
    height: 32px;  
}

.gray-title{
    text-align:right; 
    font-weight: 700; 
    font-size:0.95em;  
    color:gray;
}

.gray-body{
    margin-top:10px; text-align:right; font-size:0.85em;  color: gray;
    width: 100%;
}

.blutex{
    text-align: right;
    color: rgb(34, 96, 231);
    font-size: 0.8em;
    margin-top: 20px;
    font-weight: 700;
    margin-right: 10px;
}
</style>